benchmarks/results/python_dns_c10.txt
Running 30s test @ http://localhost:8000/api/dns
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.44ms  803.56us  15.65ms   78.41%
    Req/Sec   451.54     57.64   727.00     79.75%
  53997 requests in 30.04s, 8.65MB read
  Non-2xx or 3xx responses: 53997
Requests/sec:   1797.62
Transfer/sec:    294.92KB