benchmarks/results/python_dns_c100.txt
Running 30s test @ http://localhost:8000/api/dns
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    61.49ms   96.68ms   1.96s    98.54%
    Req/Sec   476.28     70.27   757.00     87.50%
  56992 requests in 30.07s, 9.13MB read
  Socket errors: connect 0, read 0, write 0, timeout 9
  Non-2xx or 3xx responses: 56992
Requests/sec:   1895.26
Transfer/sec:    310.94KB