benchmarks/results/python_dns_c200.txt
Running 30s test @ http://localhost:8000/api/dns
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   100.33ms   73.72ms   1.99s    97.37%
    Req/Sec   475.99    110.05     1.16k    80.91%
  56082 requests in 30.02s, 8.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 110
  Non-2xx or 3xx responses: 56082
Requests/sec:   1868.24
Transfer/sec:    306.51KB