benchmarks/results/python_dns_c50.txt
Running 30s test @ http://localhost:8000/api/dns
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.64ms   13.83ms 499.88ms   93.20%
    Req/Sec   480.28     54.78   820.00     73.67%
  57480 requests in 30.06s, 9.21MB read
  Non-2xx or 3xx responses: 57480
Requests/sec:   1912.33
Transfer/sec:    313.74KB