benchmarks/results/python_token_c10.txt
Running 30s test @ http://localhost:8000/api/token
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.43ms  820.68us  13.79ms   81.76%
    Req/Sec   451.88     47.79   626.00     74.42%
  54029 requests in 30.04s, 8.66MB read
  Non-2xx or 3xx responses: 54029
Requests/sec:   1798.53
Transfer/sec:    295.07KB