benchmarks/results/python_token_c100.txt
Running 30s test @ http://localhost:8000/api/token
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    62.69ms   97.09ms   1.96s    98.52%
    Req/Sec   465.16     91.72     0.85k    82.58%
  55692 requests in 30.08s, 8.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 13
  Non-2xx or 3xx responses: 55692
Requests/sec:   1851.55
Transfer/sec:    303.77KB