benchmarks/results/python_token_c200.txt
Running 30s test @ http://localhost:8000/api/token
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   100.87ms   67.99ms   1.97s    97.86%
    Req/Sec   475.35    116.74     1.01k    81.59%
  56141 requests in 30.09s, 8.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 100
  Non-2xx or 3xx responses: 56141
Requests/sec:   1865.66
Transfer/sec:    306.09KB