benchmarks/results/python_token_c200.txt
Running 30s test @ http://localhost:8000/api/token
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.88ms   76.06ms   1.99s    97.07%
    Req/Sec   468.88    113.49     0.95k    79.91%
  55242 requests in 30.10s, 8.85MB read
  Socket errors: connect 0, read 0, write 0, timeout 111
  Non-2xx or 3xx responses: 55242
Requests/sec:   1835.33
Transfer/sec:    301.11KB