benchmarks/results/python_token_c50.txt
Running 30s test @ http://localhost:8000/api/token
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.00ms   14.97ms 519.79ms   92.29%
    Req/Sec   474.38     59.86     0.91k    67.42%
  56748 requests in 30.04s, 9.09MB read
  Non-2xx or 3xx responses: 56748
Requests/sec:   1889.16
Transfer/sec:    309.94KB