benchmarks/results/python_token_c50.txt
Running 30s test @ http://localhost:8000/api/token
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.85ms   15.12ms 526.45ms   93.08%
    Req/Sec   478.19     55.90     0.99k    76.75%
  57199 requests in 30.05s, 9.16MB read
  Non-2xx or 3xx responses: 57199
Requests/sec:   1903.65
Transfer/sec:    312.32KB