benchmarks/results/rust_dns_c10.txt
Running 30s test @ http://localhost:8001/api/dns
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   149.31us  122.54us   7.10ms   88.17%
    Req/Sec    13.30k   664.27    15.55k    70.43%
  1593703 requests in 30.10s, 303.97MB read
  Non-2xx or 3xx responses: 1593703
Requests/sec:  52947.10
Transfer/sec:     10.10MB