benchmarks/results/rust_dns_c100.txt
Running 30s test @ http://localhost:8001/api/dns
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   845.28us  667.15us   9.53ms   82.91%
    Req/Sec    32.09k     2.34k   38.98k    66.83%
  3832102 requests in 30.01s, 730.92MB read
  Non-2xx or 3xx responses: 3832102
Requests/sec: 127685.31
Transfer/sec:     24.35MB