benchmarks/results/rust_dns_c200.txt
Running 30s test @ http://localhost:8001/api/dns
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  766.27us  13.02ms   84.07%
    Req/Sec    48.06k     4.47k   65.05k    68.83%
  5742706 requests in 30.03s, 1.07GB read
  Non-2xx or 3xx responses: 5742706
Requests/sec: 191211.34
Transfer/sec:     36.47MB