benchmarks/results/rust_dns_c200.txt
Running 30s test @ http://localhost:8001/api/dns
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  776.86us  10.11ms   83.15%
    Req/Sec    45.27k     3.88k   58.20k    68.42%
  5409680 requests in 30.04s, 1.01GB read
  Non-2xx or 3xx responses: 5409680
Requests/sec: 180106.47
Transfer/sec:     34.35MB