benchmarks/results/rust_dns_c50.txt
Running 30s test @ http://localhost:8001/api/dns
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   546.27us  444.86us   7.54ms   81.64%
    Req/Sec    23.64k     1.58k   28.55k    68.75%
  2822506 requests in 30.01s, 538.35MB read
  Non-2xx or 3xx responses: 2822506
Requests/sec:  94062.52
Transfer/sec:     17.94MB