benchmarks/results/rust_token_c10.txt
Running 30s test @ http://localhost:8001/api/token
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   147.36us  130.75us   7.03ms   92.39%
    Req/Sec    13.52k   751.28    19.65k    70.05%
  1617475 requests in 30.10s, 308.51MB read
  Non-2xx or 3xx responses: 1617475
Requests/sec:  53736.91
Transfer/sec:     10.25MB