benchmarks/results/rust_token_c10.txt
Running 30s test @ http://localhost:8001/api/token
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   143.45us  148.74us  13.52ms   97.86%
    Req/Sec    13.91k   691.40    21.97k    73.19%
  1662933 requests in 30.10s, 475.77MB read
  Non-2xx or 3xx responses: 1662933
Requests/sec:  55248.72
Transfer/sec:     15.81MB