benchmarks/results/rust_token_c100.txt
Running 30s test @ http://localhost:8001/api/token
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms  680.25us   8.12ms   83.15%
    Req/Sec    31.74k     2.37k   39.21k    67.42%
  3789952 requests in 30.01s, 1.06GB read
  Non-2xx or 3xx responses: 3789952
Requests/sec: 126287.88
Transfer/sec:     36.13MB