benchmarks/results/rust_token_c200.txt
Running 30s test @ http://localhost:8001/api/token
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  769.71us  10.89ms   83.71%
    Req/Sec    46.61k     4.05k   59.60k    66.17%
  5570086 requests in 30.03s, 1.56GB read
  Non-2xx or 3xx responses: 5570086
Requests/sec: 185482.90
Transfer/sec:     53.07MB