benchmarks/results/rust_token_c50.txt
Running 30s test @ http://localhost:8001/api/token
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   534.70us  432.61us   8.26ms   80.89%
    Req/Sec    24.11k     1.61k   29.46k    69.17%
  2879409 requests in 30.01s, 823.81MB read
  Non-2xx or 3xx responses: 2879409
Requests/sec:  95960.10
Transfer/sec:     27.45MB